Tekla.Structures.Drawing.RectangleBoundingBox
The RectangleBoundingBox class represents a bounding box for an object,
i.e. the surrounding box of the object. The bounding box contains the
calculated corner points of the box. The rectangle bounding box is
inherited from the axis-aligned bounding box. The AABB also contains methods
for getting the center point of the box.
The following example is about how to draw a polygon around an object's bounding box:
using Tekla.Structures.Drawing;
public class Example
{
static bool DrawBB(ViewBase DrawView, RectangleBoundingBox boundingBox, DrawingColors Color)
{
PointList points = new PointList();
points.Add(boundingBox.LowerLeft);
points.Add(boundingBox.UpperLeft);
points.Add(boundingBox.UpperRight);
points.Add(boundingBox.LowerRight);
Polygon MyPolygon = new Polygon(DrawView, points);
MyPolygon.Attributes.Line.Color = Color;
MyPolygon.Insert();
return true;
}
}

Tekla.Structures.Drawing.RectangleBoundingBox.UpperLeft
The upper left corner point of the bounding box.

Tekla.Structures.Drawing.RectangleBoundingBox.UpperRight
The upper right corner point of the bounding box.

Tekla.Structures.Drawing.RectangleBoundingBox.LowerLeft
The lower left corner point of the bounding box.

Tekla.Structures.Drawing.RectangleBoundingBox.LowerRight
The lower right corner point of the bounding box.

Tekla.Structures.Drawing.RectangleBoundingBox.Width
The width of the bounding box.

Tekla.Structures.Drawing.RectangleBoundingBox.Height
The height of the bounding box.

Tekla.Structures.Drawing.RectangleBoundingBox.AngleToAxis
The angle of the bounding box in relation to the axis (the coordinate system's X-plane).

Tekla.Structures.Drawing.RectangleBoundingBox.CreateRectangleBoundingBox(Tekla.Structures.Geometry3d.Point,System.Double,System.Double,System.Double)
Creates a new RectangleBoundingBox with the given values.
CenterPoint: The center point of the bounding box.
Width: The width of the bounding box.
Height: The height of the bounding box.
AngleToAxis: The angle of the box (compared to the X-axis).
Returns: The created rectangle bounding box.

Tekla.Structures.Drawing.RectangleBoundingBox.ToString
Returns the rectangle bounding box values as a string.
Returns: The rectangle bounding box values as a string.

Tekla.Structures.Drawing.RectangleBoundingBox.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.